<html>	<head>		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">		<meta name="generator" content="Adobe GoLive 4">		<title>Introduzione</title>	</head>	<body bgcolor="white">		<table cool width="579" height="3107" border="0" cellpadding="0" cellspacing="0" gridx="16" showgridx usegridx gridy="16" showgridy usegridy>			<tr height="1" cntrlrow>				<td width="1" height="1"></td>				<td width="16" height="1"><spacer type="block" width="16" height="1"></td>				<td width="32" height="1"><spacer type="block" width="32" height="1"></td>				<td width="32" height="1"><spacer type="block" width="32" height="1"></td>				<td width="8" height="1"><spacer type="block" width="8" height="1"></td>				<td width="8" height="1"><spacer type="block" width="8" height="1"></td>				<td width="128" height="1"><spacer type="block" width="128" height="1"></td>				<td width="224" height="1"><spacer type="block" width="224" height="1"></td>				<td width="128" height="1"><spacer type="block" width="128" height="1"></td>			</tr>			<tr height="53">				<td width="1" height="53"><spacer type="block" width="1" height="53"></td>				<td width="16" height="53"></td>				<td width="32" height="53"></td>				<td width="32" height="53"></td>				<td width="8" height="53"></td>				<td width="8" height="53"></td>				<td width="352" height="53" colspan="2" rowspan="1" valign="top" align="left" xpos="96" content bgcolor="yellow" csheight="53">					<center>						<font face="New York" size="5" color="#0000dd"><u><b>Introduzione (calcolatore, DOS, Windows)</b></u></font><b><font size="5"> (8/3/00)</font></b></center>				</td>				<td width="128" height="53"></td>			</tr>			<tr height="17">				<td width="1" height="17"><spacer type="block" width="1" height="17"></td>				<td width="16" height="17"></td>				<td width="32" height="17"></td>				<td width="32" height="17"></td>				<td width="8" height="17"></td>				<td width="8" height="17"></td>				<td width="128" height="17"></td>				<td width="224" height="17"></td>				<td width="128" height="17"></td>			</tr>			<tr height="240">				<td width="1" height="240"><spacer type="block" width="1" height="240"></td>				<td width="16" height="240"></td>				<td width="560" height="240" colspan="7" rowspan="1" valign="top" align="left" xpos="16" content csheight="237"><font face="Helvetica" size="5" color="#0000dd"><u><b>Aspetto di Windows</b></u></font>					<div align="justify">						<p><font face="Times">Acceso il calcolatore, dopo il <i>bootstrap</i> (che corrisponde alla fase di predisposizione al funzionamento), &egrave; attivo un particolare programma: il Sistema Operativo.</font></p>						<p><font face="Times">Un sistema operativo &egrave; un insieme di programmi eseguibili che funge da interfaccia tra l'utente e il calcolatore. Esso intercetta tutte le richieste fatte dall'utente, relativamente all'uso di risorse disponibili nel calcolatore, e le soddisfa (se possibile &#133;).</font></p>						<p><font face="Times">Le macchine del laboratorio adottano il sistema operativo WINDOWS NT.</font></p>						<p><font face="Times">L'utente comunica le proprie richieste utilizzando due principali strumenti di <i>input</i>: la <u>tastiera</u> e il <u>mouse</u>. In un sistema operativo come WINDOWS, l'uso del mouse &egrave; importante: le risorse del calcolatore sono rappresentate per lo pi&ugrave; da figure che appaiono sullo schermo (le <i>icone</i>) e l'uso di queste risorse viene richiesto dall'utente mediante il mouse. Con la tastiera le &quot;richieste di uso di risorse&quot; vengono impartite al calcolatore per iscritto: &egrave; cio&egrave; possibile comunicare le proprie richieste mediante un apposito linguaggio di comandi.</font></div>				</td>			</tr>			<tr height="34">				<td width="1" height="34"><spacer type="block" width="1" height="34"></td>				<td width="16" height="34"></td>				<td width="32" height="34"></td>				<td width="400" height="34" colspan="5" rowspan="1" valign="top" align="left" xpos="48">					<table border="4" cellpadding="0" cellspacing="2" width="400" bgcolor="yellow">						<tr>							<td>								<center>									<a href="intro/Image1.gif"><b>finestra sessione di lavoro con windows</b></a></center>							</td>						</tr>					</table>				</td>				<td width="128" height="34"></td>			</tr>			<tr height="1176">				<td width="1" height="1176"><spacer type="block" width="1" height="1176"></td>				<td width="16" height="1176"></td>				<td width="560" height="1176" colspan="7" rowspan="1" valign="top" align="left" xpos="16" content csheight="1176"><font face="Times">La figura rappresenta un esempio di immagine video durante una sessione di lavoro in WINDOWS. Oltre alle icone, notiamo anche dei contenitori di icone, le <i>finestre</i>. In figura sono rappresentate due finestre. Una finestra &egrave; uno spazio delimitato all'interno dello schermo. Ad ogni finestra &egrave; assegnato un nome.</font>					<p><font face="Times">Osservando la finestra &quot;Tp&quot;, &egrave; possibile individuare i due tipi di icone fondamentali, quella corrispondente ad un FILE di dati e quella corrispondente ad una DIRECTORY.</font></p>					<div align="justify">						<p><font face="Times">I file (e quindi le directory) contengono tutte le informazioni disponibili al calcolatore nelle sue unit&agrave; di memoria secondaria (hard disk, floppy disk, CD &#133;).</font></p>						<p><font face="Times">L'organizzazione di queste informazioni e la loro reperibilit&agrave; &egrave; amministrata dal File System che &egrave; una delle componenti del sistema operativo.</font></p>					</div>					<p><font face="Times" size="5" color="#0000dd"><u><b>File System</b></u></font></p>					<p><font face="Times"><b>File: </b>Un blocco unitario di locazioni in memoria secondaria, contenente informazioni omogenee e contraddistinto da un nome.</font></p>					<p><font face="Times"><b>Directory: </b>Contenitore che raggruppa sotto uno stesso nome pi&ugrave; file (e altre directory)</font></p>					<p><font face="Times" color="#0000dd" size="4"><b>Il nome del file</b></font></p>					<div align="justify">						<p><font face="Times">Il nome di un file pu&ograve; essere semplicemente una sequenza di caratteri. Di solito per&ograve; &egrave; del tipo</font></p>					</div>					<center>						<p><font face="Courier">Nomefile.estensione</font></p>					</center>					<div align="justify">						<p><font face="Times">Ad esempio,</font></p>						<p><font face="Courier">Filelist.doc,Turbo.tpl,Readme.txt,Turbo.exe,indiani.pas, matr.for</font></p>						<p><font face="Times">L'estensione caratterizza il tipo di dati contenuti nel file.</font></p>						<p><font face="Times">Nel vecchio sistema operativo DOS (base per lo sviluppo degli odierni sistemi operativi Windows), </font><font face="Courier">nomefile</font><font face="Times"> doveva essere di al pi&ugrave; 8 caratteri e l'estensione di 3. In WINDOWS l'estensione pu&ograve; anche non esserci. Se c'&egrave;, nella maggioranza dei casi viene usata per associare una icona particolare al file. Ad esempio</font></p>						<p><font face="Courier">Unzip.exe</font><font face="Times"> ha un&#146;icona che permette di individuarlo immediatamente come file eseguibile.</font></p>						<p><font face="Courier">Filelist.doc</font><font face="Times"> ha un'icona che lo evidenzia come file &quot;word&quot; (cio&egrave; da usare con un particolare programma di word processing che si chiama WORD).</font></p>						<p><font face="Times">Una volta associata un icona ad un tipo di file, diventa superfluo mostrare l&#146;estensione che potrebbe quindi essere omessa nella visualizzato: sullo schermo vedremo ad esempio i nomi </font><font face="Courier">filelist</font><font face="Times"> o </font><font face="Courier">Turbo</font><font face="Times"> o </font><font face="Courier">Unzip</font><font face="Times">. Si noti la presenza di due &quot;</font><font face="Courier">Turbo</font><font face="Times">&quot;, che sono per&ograve; due file distinti. Il primo ha in realt&agrave; estensione </font><font face="Courier">.exe</font><font face="Times"> (e quindi gli viene associata l'icona dei file eseguibili). Il secondo ha in realt&agrave; estensione </font><font face="Courier">.ico</font><font face="Times"> (con relativa icona). Per i file privi di estensione (come uno dei due </font><font face="Courier">Readme</font><font face="Times">) si usa una icona standard. La stessa icona standard &egrave; usata per i file aventi una estensione &quot;non prevista&quot; dal gestore delle icone di WINDOWS.</font></p>					</div>					<p><font face="Times" size="4" color="#0000dd"><b>Le unit&agrave; di memoria secondaria</b></font></p>					<div align="justify">						<p><font face="Times">Ogni unit&agrave; di memoria secondaria ha un <b>nome logico</b> che corrisponde ad un &quot;indirizzo&quot; associato con quella unit&agrave; e che permette di individuarla in modo univoco.</font></p>						<ul>							<p><font face="Courier">A:</font><font face="Times"> &egrave; il nome logico dell'unit&agrave; di gestione dei floppy disk</font></p>							<p><font face="Courier">B: </font><font face="Times">&egrave; il nome logico di una eventuale seconda unit&agrave; di gestione dei floppy disk</font></p>							<p><font face="Courier">C: </font><font face="Times">&egrave; il nome logico dell'hard disk</font></p>							<p><font face="Courier">D: E: &#133;</font><font face="Times">tutte le altre lettere vengono usate per le eventuali altre periferiche di memoria</font></p>						</ul>						<p><font face="Times">connesse al calcolatore (altri hard disk, unit&agrave; di gestione per i CD,zip, etc).</font></p>						<p><font face="Times">L&#146;unit&agrave; </font><font face="Courier">C:</font><font face="Times"> &egrave; particolarmente importante, perch&eacute; di solito si riferisce all&#146;unit&agrave; disco che contiene anche il sistema operativo. Useremo C: per spiegare il path di identificazione di un file. Tutto quel che diremo vale anche per le altre &quot;lettere&quot; &#133;</font></p>					</div>					<p><font face="Times" size="4" color="#0000dd"><b>Identificazione di un file</b></font></p>					<div align="justify">						<p><font face="Times">Dato un file, questo sar&agrave; contenuto in una certa unit&agrave; di memoria secondaria.</font></p>						<p><font face="Times">Spesso per usare un file non basta &quot;cliccare&quot; col mouse, ma bisogna scrivere esplicitamente il suo nome. E quasi sempre scrivere solo <i>nomefile</i> e eventualmente <i>estensione</i> non basta. Infatti va specificato con precisione &quot;dove&quot; il file si trova all'interno dell'unit&agrave; di memoria secondaria in cui &egrave; contenuto. Ci&ograve; per &quot;individuarlo&quot; univocamente, distinguendolo da eventuali altri file che abbiano stesso nome e estensione.</font></p>						<p><font face="Times">Evidentemente la prima informazione utile all'individuazione del file &egrave; il nome dell'unit&agrave; di memoria in cui esso &egrave; contenuto.</font></p>						<p><font face="Times">Ad esempio l'individuazione esatta del file </font><font face="Courier">logo.sys</font><font face="Times"> della prossima figura &egrave; data dal suo nome e dal fatto che sta nel disco </font><font face="Courier">C:</font><font face="Times">. Il suo nome completo &egrave; pertanto </font><font face="Courier">C:\logo.sys</font><font face="Times">.</font></p>						<p><font face="Times">Sappiamo per&ograve; che un file potrebbe essere contenuto in una directory, e questa potrebbe essere contenuta in un'altra e cos&igrave; via.</font></p>						<p><font face="Times">Ad esempio, il file </font><font face="Courier">turbo.exe</font><font face="Times"> (la 't' maiuscola o minuscola non ha importanza) risiede nella directory </font><font face="Courier">BIN</font><font face="Times">, che risiede nella directory </font><font face="Courier">TP</font><font face="Times"> che sta in </font><font face="Courier">C:</font><font face="Times">.</font></p>						<p><font face="Times">Il nome completo del file in questione &egrave; </font><font face="Courier">C:\TP\BIN\turbo.exe</font><font face="Times">. Il <i>percorso</i> di directory e nome logico dell'unit&agrave; che permette di individuare il file si chiama <b>path</b>. Nel path i singoli nomi sono separati dal carattere '\' (backslash).</font></p>						<p><font face="Times">Nella figura seguente &egrave; mostrata la posizione del file, e la directory TP appare dentro la finestra Pc disk (C:). (curiosit&agrave;: Windows &egrave; proprio la directory in cui sono contenuti tutti i file/programmi che compongono il sistema operativo.)</font></div>				</td>			</tr>			<tr height="32">				<td width="1" height="32"><spacer type="block" width="1" height="32"></td>				<td width="16" height="32"></td>				<td width="32" height="32"></td>				<td width="32" height="32"></td>				<td width="496" height="32" colspan="5" rowspan="1" valign="top" align="left" xpos="80">					<table border="4" cellpadding="0" cellspacing="2" width="400" bgcolor="yellow">						<tr>							<td>								<center>									<a href="intro/Image2.gif"><b>ambiente windows con contenuto disco C:</b></a></center>							</td>						</tr>					</table>				</td>			</tr>			<tr height="448">				<td width="1" height="448"><spacer type="block" width="1" height="448"></td>				<td width="16" height="448"></td>				<td width="560" height="448" colspan="7" rowspan="1" valign="top" align="left" xpos="16" content csheight="432"><font face="Times">Per ricapitolare: se vogliamo identificare un file, dobbiamo specificarne non solo il nome (NOMEFILE seguito dalla possibile ESTENSIONE), ma anche tutto il percorso di directory che ci permettono di arrivare al file, a partire da C: (o dall'unit&agrave; di memoria secondaria in cui il file &egrave; memorizzato).</font>					<p><font face="Helvetica" color="#0000dd" size="5"><u><b>DOS</b></u></font></p>					<div align="justify">						<p><font face="Times">Il Dos &egrave; il sistema operativo adottato dalle macchine tipo PC fino a non molti anni fa. &Egrave; comunque presente anche nei calcolatori su cui &egrave; istallato WINDOWS, il quale deve interagire costantemente con DOS. Ad esempio il modo di indirizzare i file con percorso\NOMEFILE.EXT discende direttamente dal DOS. Inoltre quando useremo il TurboPascal dovremo essere in grado di fare cose elementari con il DOS (come ad esempio scrivere il nome del file in cui vogliamo scrivere il programma), e potremo occasionalmente &quot;entrare nella DOS-shell&quot; per compiere delle operazioni. Infatti una volta entrati nel programma TurboPascal (TP) non &egrave; possibile interagire con Windows se non uscendo dal TP, mentre invece &egrave; possibile interagire con il Dos entrando temporaneamente in una finestra (chiamata appunto Dos shell) per poi tornare nell&#146;ambiente TP dove tutto &egrave; rimasto immutato. Perch&eacute; uno/una debba interagire con il sistema operativo mentre scrive programmi &#133; sar&agrave; chiaro in seguito.</font></p>					</div>					<p><font face="Times" size="4" color="#0000dd"><b>Finestra DOS (DOS Prompt)</b></font></p>					<div align="justify">						<p><font face="Times">I movimenti del mouse si comunicano ad un cursore (a forma di freccia, di solito) che appare sullo schermo. Muovete il mouse e individuate il cursore, se non lo avete gi&agrave; fatto).</font></p>						<p><font face="Times">Quando la freccia &egrave; posizionata su una icona, premendo il pulsante sinistro del mouse, l'icona cambia colore: si dice che &egrave; <i>selezionata</i>.</font></p>						<p><font face="Times">Selezionare l'icona a forma di pulsante in basso a sinistra dello schermo, su cui &egrave; scritto AVVIO (START).</font></p>						<p><font face="Times">Quel che succede &egrave; definito &quot;apertura di un men&ugrave; a tendina&quot;. Viene infatto visualizzata una colonna di nomi (ciascuno anche accoppiato ad una piccola icona).</font></p>						<p><font face="Times">Muovendo il mouse in alto e in basso (senza bisogno di cliccare) si selezionano le varie voci.</font></p>						<p><font face="Times">Selezionare la voce PROGRAMMI (PROGRAMS). Si apre un altro men&ugrave;, sul quale bisogna trasferire la freccia muovendo il mouse per selezionare la voce PROMPT DI MS-DOS. A questo punto si apre una finestra particolare sul video, all'interno della quale &egrave; possibile far eseguire comandi del sistema operativo DOS.</font></div>				</td>			</tr>			<tr height="48">				<td width="1" height="48"><spacer type="block" width="1" height="48"></td>				<td width="16" height="48"></td>				<td width="32" height="48"></td>				<td width="32" height="48"></td>				<td width="8" height="48"></td>				<td width="488" height="48" colspan="4" rowspan="1" valign="top" align="left" xpos="88">					<table border="4" cellpadding="0" cellspacing="2" width="400" bgcolor="yellow">						<tr>							<td>								<center>									<a href="intro/Image3.gif"><b>finestra sistema operativo DOS</b></a></center>							</td>						</tr>					</table>				</td>			</tr>			<tr height="992">				<td width="1" height="992"><spacer type="block" width="1" height="992"></td>				<td width="16" height="992"></td>				<td width="560" height="992" colspan="7" rowspan="1" valign="top" align="left" xpos="16" content csheight="976"><font face="Times">La sequenza di caratteri </font><font face="Courier">C:\WINDOWS&gt;</font><font face="Times"> si chiama prompt in quanto indica la disponibilit&agrave; del sistema operativo a ricevere comandi.</font>					<div align="justify">						<p><font face="Times">Incidentalmente fornisce anche informazioni sulla situazione relativa al file system: su quale unit&agrave; di memoria secondaria siamo &quot;posizionati&quot; e, in essa, all'interno di quali directory.</font></p>						<p><font face="Times">Nella figura precedente, DOS ci dice che possiamo inserire comandi e che siamo posizionati all'interno della directory WINDOWS dentro al disco C:.</font></p>						<p><font face="Times">I comandi, in un sistema operativo come DOS, vanno scritti usando la tastiera e &quot;inviati&quot;, cio&egrave; comunicati al DOS perch&eacute; li esegua. Questo invio avviene premendo il tasto di return, dopo che la scrittura del comando &egrave; stata completata. Il nome o il simbolo presente sul tasto di return potrebbe esser Ret, &quot;</font><font face="Symbol"><b>&oslash;</b></font><font face="Times">&quot; o Return, o Enter &#133;</font></p>					</div>					<p><font face="Times" size="4" color="#0000dd"><u><b>Alcuni comandi di base del DOS</b></u></font></p>					<div align="justify">						<p><font face="Courier" color="#dd0000"><b>DIR</b></font><font face="Times" color="#dd0000">:</font><font face="Times"> visualizza il contenuto della directory corrente. Ad esempio, nel caso della figura precedente, se scriviamo DIR e premiamo il tasto di return, il calcolatore stampa sul video la lista di tutti i file e directory presenti nella directory WINDOWS in C:.</font></p>						<p><font face="Courier" color="#dd0000"><b>DIR &quot;PATH&quot;</b></font><font face="Courier"> Dir </font><font face="Times">&egrave; un comando elastico e accetta anche l'aggiunta di una specifica di path. In tal caso visualizza sul video il contenuto della directory individuata dal path. Ad esempio DIR</font><font face="Courier"> A:\fonda\lez1</font><font face="Times"> ci permette di vedere il contenuto della directory lez1 contenuta nella directory </font><font face="Courier">fonda</font><font face="Times"> nell&#146;unit&agrave; floppy (dischetto) A:.</font></p>						<p><font face="Courier" color="#dd0000"><b>CD:</b></font><font face="Times"> abbiamo detto che il prompt indica la directory sulla quale siamo posizionati. CD permette di cambiare tale posizionamento. Ad esempio l'esecuzione di</font></p>						<p><font face="Courier" color="#dd0000">CD C:\TP</font><font face="Times"> modifica la directory corrente, in modo che sia la TP dentro a C:. Come conseguenza il prompt sar&agrave; modificato in </font><font face="Courier">C:\TP&gt;</font></p>						<p><font face="Times">Non sempre &egrave; necessario scrivere un path completo (anzi quasi mai &#133;). Se siamo posizionati in </font><font face="Courier">C:\T</font><font face="Times">P e eseguiamo il comando cd BIN, la directory BIN diventa quella corrente. Il prompt si trasforma in </font><font face="Courier">C:\TP\BIN</font><font face="Times">.</font></p>						<p><font face="Courier">CD, Cd, cd</font><font face="Times"> sono la stessa cosa.</font></p>						<p><font face="Courier" color="#dd0000">CD ..</font><font face="Courier"> (CD </font><font face="Times">seguito da due punti</font><font face="Courier">)</font><font face="Times"> &quot;sposta all'indietro&quot; (si dice anche che &quot;risale&quot;) di un passo nella gerarchia delle directory. La directory che contiene quella in cui siamo posizionati diventa corrente. Se siamo posizionati in </font><font face="Courier">C:\TP\BIN</font><font face="Times"> ed eseguiamo </font><font face="Courier">CD ..</font><font face="Times"> il prompt diventa </font><font face="Courier">C:\TP&gt;</font><font face="Times"> (e </font><font face="Courier">TP</font><font face="Times"> &egrave; la nuova directory corrente). Se eseguiamo </font><font face="Courier">CD ..</font><font face="Times"> ancora una volta arriviamo alla &quot;radice&quot; dell'unit&agrave; </font><font face="Courier">C: </font><font face="Times">(il prompt diventa </font><font face="Courier">C:\&gt;).</font><font face="Times"> &Egrave; impossibile risalire piu' indietro.</font></p>						<p><font face="Times">Per cambiare l&#146;unit&agrave; disco su cui siamo posizionati, &egrave; sufficiente scrivere la lettera che indica l&#146;unit&agrave; desiderata seguita dai due punti. Per esempio il comando </font><font face="Courier"><b>A:</b></font><font face="Times"> ci posiziona sull&#146;unit&agrave; A: cio&egrave; sul gestore (<i>driver</i>) dei floppy disk (il prompt cambia in </font><font face="Courier">A:\&gt;)</font><font face="Times">. Se poi facciamo DIR, vediamo il contenuto del floppy disk (se &egrave; inserito).</font></p>						<p><font face="Courier" color="#dd0000"><b>FORMAT</b></font><font face="Times" color="#dd0000"> </font><font face="Times">&egrave; il comando per formattare le unit&agrave; di memoria secondaria (soprattutto i floppy disk).</font></p>						<p><font face="Times">L'operazione di formattazione &quot;predispone l'uso del disco come supporto di memoria secondaria&quot;: si controlla l'integrit&agrave; fisica del supporto; si predispongono i dati relativi all'organizzazione del disco (ad esempio viene &quot;creata&quot; la directory radice, come A:\).</font></p>						<p><font face="Courier">FORMAT A:</font><font face="Times"> oppure </font><font face="Courier">FORMAT A:\</font><font face="Times"> formatta il disco contenuto nell'unit&agrave; A: viene richiesto di</font></p>						<ul>							<ul>								<p><font face="Courier"><b>inserire un dischetto nel drive A:</b></font></p>							</ul>						</ul>						<p><font face="Times">e premere un tasto quando fatto poi inizia la formattazione</font></p>						<ul>							<ul>								<p><font face="Courier"><b>&#133; formattazione in corso &#133;</b></font></p>							</ul>						</ul>						<p><font face="Times">poi viene richiesto di dare un nome al dischetto (label = etichetta)</font></p>						<ul>							<ul>								<p><font face="Courier"><b>label (11 caratteri che etichettano il disco)</b></font></p>							</ul>						</ul>						<p><font face="Times">poi vengono date alcune informazioni e si passa, se necessario a formattare un successivo dischetto</font></p>						<ul>							<ul>								<p><font face="Courier"><b>altro disco ?</b></font></p>							</ul>						</ul>						<p><font face="Times">(se dobbiamo formattare altri dischi rispondiamo positiviamente, altrimenti negativamente).</font></p>						<p><font face="Times">Come risultato, il contenuto attuale del dischetto viene cancellato, le tracce ed i settori del disco vengono predisposti per contenere dati secondo le modalit&agrave; previste per un PC.</font></p>						<p><font face="Courier" color="#dd0000"><b>COPY</b> &lt;NOMEFILE1&gt; &lt;NOMEFILE2&gt;</font><font face="Times"> copia il file </font><font face="Courier">&lt;NOMEFILE1&gt;</font><font face="Times"> nel file </font><font face="Courier">&lt;NOMEFILE2&gt;</font></p>						<p><font face="Courier" color="#dd0000"><b>DEL</b> &lt;NOMEFILE&gt;</font><font face="Times"> cancella il file </font><font face="Courier">&lt;NOMEFILE&gt;. </font><font face="Times">(non &egrave; pi&ugrave; possibile recuperarlo, quindi attenti alle cancellazioni).</font></p>						<p><font face="Times">Per tutti gli altri comandi significativi e per i dovuti approfondimenti, conviene guardare la dispensa di DOS consigliata nel materiale del corso.</font></div>				</td>			</tr>			<tr height="64">				<td width="1" height="64"><spacer type="block" width="1" height="64"></td>				<td width="16" height="64"></td>				<td width="32" height="64"></td>				<td width="32" height="64"></td>				<td width="8" height="64"></td>				<td width="8" height="64"></td>				<td width="128" height="64"></td>				<td width="352" height="64" colspan="2" rowspan="1" valign="top" align="left" xpos="224" content csheight="64"><a href="../../fond-cemn.html"><font size="5"><blink>Torna alla pagina didattica</blink></font></a>					<p><font size="5"><a href="../ea.html"><blink>Torna alla pagina esercitazioni autoguidate</blink></a></font></td>			</tr>		</table>	</body></html>